hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/inc/hc32m120_timer4.h
    uint16_t u16PwmOutputPolarity;          /*!< TIM4_<t>_OxH and TIM4_<t>_OxL output polarity
                                                 This parameter can be a value of @ref TIMER4_PWM_Output_Polarity */

    en_functional_state_t enRtIntMaskCmd;   /*!< Enable or disable mask PWM reload-timer interrupt
                                                 This parameter can be a value of @ref en_functional_state_t */
} stc_timer4_pwm_init_t;

/**
 * @brief Timer4 Special-EVT trigger condition
 */
typedef struct
{
    en_functional_state_t enDownMatchCmd;   /*!< Enable or disable trigger signal when match with SCCR&SCMR and Timer4 CNT count down
                                                 This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enPeakMatchCmd;   /*!< Enable or disable trigger signal when match with SCCR&SCMR and Timer4 CNT count peak
                                                 This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enUpMatchCmd;     /*!< Enable or disable trigger signal when match with SCCR&SCMR and Timer4 CNT count up
                                                 This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enZeroMatchCmd;   /*!< Enable or disable perform to compare with the CNT zero interrupt mask counter
                                                 This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enCmpAmcZicCmd;   /*!< Enable or disable perform to compare with the CNT zero interrupt mask counter
                                                 This parameter can be a value of @ref en_functional_state_t */

    en_functional_state_t enCmpAmcPicCmd;   /*!< Enable or disable perform to compare with the CNT peak interrupt mask counter
                                                 This parameter can be a value of @ref en_functional_state_t */

    uint16_t              u16MaskTimes;     /*!< Specifies start time by the value to be compared with the CNT interrupt mask counter */
} stc_timer4_sevt_trigger_cond_t;

/**
 * @brief Timer4 Special-EVT initialization configuration
 */
typedef struct
{
    uint16_t u16SccrVal;                    /*!< Timer4 Special-EVT compare match value.
                                                 This parameter can be a value of half-word */

    uint16_t u16Mode;                       /*!< Configure Timer4 Special-EVT Running mode
                                                 This parameter can be a value of @ref TIMER4_SEVT_Mode */

    uint16_t u16TrigEvt;                    /*!< Timer4 Special-EVT trigger signal event
                                                 This parameter can be a value of @ref TIMER4_SEVT_Trigger_Event */

    uint16_t u16BufMode;                    /*!< Buffer mode
                                                 This parameter can be a value of @ref TIMER4_SEVT_Buffer_Mode */

    en_functional_state_t enLinkTransfer;   /*!< Enable or disable the buffer linked transfer with the CNT interrupt mask counter
                                                 This parameter can be a value of @ref en_functional_state_t */

    stc_timer4_sevt_trigger_cond_t  stcTriggerCond; /*!< Timer4 Special-EVT trigger event when match trigger condition 
                                                         This structure details refer @ref stc_timer4_sevt_trigger_cond_t */
} stc_timer4_sevt_init_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TIMER4_Global_Macros TIMER4 Global Macros
 * @{
 */

/**
 * @defgroup TIMER4_Result_Code TIMER4 Result Code
 * @{
 */
#define TIMER4_RESULT_ERROR                     ((uint16_t)0xFFFFu)
/**
 * @}
 */

/**
 * @defgroup TIMER4_CNT_Macros TIMER4 Counter Macros
 * @{
 */

/** @defgroup TIMER4_CNT_Clock_Division TIMER4 Count Clock Division
 * @{
 */
#define TIMER4_CNT_CLK_DIV1                     ((uint16_t)0x0000u)         /*!< PCLK      */
#define TIMER4_CNT_CLK_DIV2                     (TMR4_CCSR_CKDIV_0)         /*!< PCLK/2    */
#define TIMER4_CNT_CLK_DIV4                     (TMR4_CCSR_CKDIV_1)         /*!< PCLK/4    */
#define TIMER4_CNT_CLK_DIV8                     (TMR4_CCSR_CKDIV_1 | \
                                                 TMR4_CCSR_CKDIV_0)         /*!< PCLK/8    */
#define TIMER4_CNT_CLK_DIV16                    (TMR4_CCSR_CKDIV_2)         /*!< PCLK/16   */
#define TIMER4_CNT_CLK_DIV32                    (TMR4_CCSR_CKDIV_2 | \
                                                 TMR4_CCSR_CKDIV_0)         /*!< PCLK/32   */
#define TIMER4_CNT_CLK_DIV64                    (TMR4_CCSR_CKDIV_2 | \
                                                 TMR4_CCSR_CKDIV_1)         /*!< PCLK/64   */
#define TIMER4_CNT_CLK_DIV128                   (TMR4_CCSR_CKDIV_2 | \
                                                 TMR4_CCSR_CKDIV_1 | \
                                                 TMR4_CCSR_CKDIV_0)         /*!< PCLK/128  */
#define TIMER4_CNT_CLK_DIV256                   (TMR4_CCSR_CKDIV_3)         /*!< PCLK/256  */
#define TIMER4_CNT_CLK_DIV512                   (TMR4_CCSR_CKDIV_3 | \
                                                 TMR4_CCSR_CKDIV_0)         /*!< PCLK/512  */
#define TIMER4_CNT_CLK_DIV1024                  (TMR4_CCSR_CKDIV_3 | \
                                                 TMR4_CCSR_CKDIV_1)         /*!< PCLK/1024 */
/**
 * @}
 */

/**
 * @defgroup TIMER4_CNT_Mode Timer4 Count Mode
 * @{
 */
#define TIMER4_CNT_MODE_SAWTOOTH_WAVE           ((uint16_t)0x0000u)
#define TIMER4_CNT_MODE_TRIANGLE_WAVE           (TMR4_CCSR_MODE)
/**
 * @}
 */

/**
 * @defgroup TIMER4_CNT_Flag TIMER4 Count Flag
 * @{
 */
#define TIMER4_CNT_FLAG_PEAK                    (TMR4_CCSR_IRQPF)
#define TIMER4_CNT_FLAG_ZERO                    (TMR4_CCSR_IRQZF)
/**
 * @}
 */

/**
 * @defgroup TIMER4_CNT_Interrupt TIMER4 Count Interrupt
 * @{
 */
#define TIMER4_CNT_IT_PEAK                      (TMR4_CCSR_IRQPEN)
#define TIMER4_CNT_IT_ZERO                      (TMR4_CCSR_IRQZEN)
/**
 * @}
 */

/**
 * @defgroup TIMER4_CNT_Clock_Source TIMER4 Count Clock Source
 * @{
 */
#define TIMER4_CNT_PCLK                         ((uint16_t)0x0000u)
#define TIMER4_CNT_EXTCLK                       (TMR4_CCSR_ECKEN)
/**
 * @}
 */

/** @defgroup TIMER4_CNT_Interrupt_Mask_Times TIMER4 Count Interrupt Mask Times
 * @{
 */
#define TIMER4_CNT_INT_MASK_0                   ((uint16_t)0x0000u)     /*!< CNT interrupt flag is always set(not masked) for every CNT count at "0x0000" */
#define TIMER4_CNT_INT_MASK_1                   (TMR4_CVPR_ZIM_0)       /*!< CNT interrupt flag is set once for 2 every CNT counts at "0x0000" (skiping 1 count) */
#define TIMER4_CNT_INT_MASK_2                   (TMR4_CVPR_ZIM_1)       /*!< CNT interrupt flag is set once for 3 every CNT counts at "0x0000" (skiping 2 count) */
#define TIMER4_CNT_INT_MASK_3                   (TMR4_CVPR_ZIM_1 | \
                                                 TMR4_CVPR_ZIM_0)       /*!< CNT interrupt flag is set once for 4 every CNT counts at "0x0000" (skiping 3 count) */
#define TIMER4_CNT_INT_MASK_4                   (TMR4_CVPR_ZIM_2)       /*!< CNT interrupt flag is set once for 5 every CNT counts at "0x0000" (skiping 4 count) */
#define TIMER4_CNT_INT_MASK_5                   (TMR4_CVPR_ZIM_2 | \
                                                 TMR4_CVPR_ZIM_0)       /*!< CNT interrupt flag is set once for 6 every CNT counts at "0x0000" (skiping 5 count) */
#define TIMER4_CNT_INT_MASK_6                   (TMR4_CVPR_ZIM_2 | \
                                                 TMR4_CVPR_ZIM_1)       /*!< CNT interrupt flag is set once for 7 every CNT counts at "0x0000" (skiping 6 count) */
#define TIMER4_CNT_INT_MASK_7                   (TMR4_CVPR_ZIM_2 | \
                                                 TMR4_CVPR_ZIM_1 | \
                                                 TMR4_CVPR_ZIM_0)       /*!< CNT interrupt flag is set once for 8 every CNT counts at "0x0000" (skiping 7 count) */
#define TIMER4_CNT_INT_MASK_8                   (TMR4_CVPR_ZIM_3)       /*!< CNT interrupt flag is set once for 9 every CNT counts at "0x0000" (skiping 8 count) */
#define TIMER4_CNT_INT_MASK_9                   (TMR4_CVPR_ZIM_3 | \
                                                 TMR4_CVPR_ZIM_0)       /*!< CNT interrupt flag is set once for 10 every CNT counts at "0x0000" (skiping 9 count) */
#define TIMER4_CNT_INT_MASK_10                  (TMR4_CVPR_ZIM_3 | \
                                                 TMR4_CVPR_ZIM_1)       /*!< CNT interrupt flag is set once for 11 every CNT counts at "0x0000" (skiping 10 count) */
#define TIMER4_CNT_INT_MASK_11                  (TMR4_CVPR_ZIM_3 | \
                                                 TMR4_CVPR_ZIM_1 | \
                                                 TMR4_CVPR_ZIM_0)       /*!< CNT interrupt flag is set once for 12 every CNT counts at "0x0000" (skiping 11 count) */
#define TIMER4_CNT_INT_MASK_12                  (TMR4_CVPR_ZIM_3 | \
                                                 TMR4_CVPR_ZIM_2)       /*!< CNT interrupt flag is set once for 13 every CNT counts at "0x0000" (skiping 12 count) */
#define TIMER4_CNT_INT_MASK_13                  (TMR4_CVPR_ZIM_3 | \
                                                 TMR4_CVPR_ZIM_2 | \
                                                 TMR4_CVPR_ZIM_0)       /*!< CNT interrupt flag is set once for 14 every CNT counts at "0x0000" (skiping 13 count) */
#define TIMER4_CNT_INT_MASK_14                  (TMR4_CVPR_ZIM_3 | \
                                                 TMR4_CVPR_ZIM_2 | \
                                                 TMR4_CVPR_ZIM_1)       /*!< CNT interrupt flag is set once for 15 every CNT counts at "0x0000" (skiping 14 count) */
#define TIMER4_CNT_INT_MASK_15                  (TMR4_CVPR_ZIM)         /*!< CNT interrupt flag is set once for 16 every CNT counts at "0x0000" (skiping 15 count) */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup TIMER4_OCO_Macros TIMER4 Output Compare Macros
 * @{
 */

