hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/inc/hc32m120_timer4.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TIMER4_Global_Functions
 * @{
 */

/**
 * @brief Set Timer4 CNT clock source
 * @param  [in] u16ClkSrc               Timer4 CNT clock source
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_PCLK:      Uses the internal clock (PCLK) as CNT's count clock
 *           @arg TIMER4_CNT_EXTCLK:    Uses an external input clock (EXCK) as CNT's count clock
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_SetClock(uint16_t u16ClkSrc)
{
    /* Set external clock enable bit */
    bM0P_TMR4->CCSR_b.ECKEN = u16ClkSrc ? 1ul : 0ul;
}

/**
 * @brief Get Timer4 CNT clock source
 * @param  None
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_CNT_PCLK:      Uses the internal clock (PCLK) as CNT's count clock
 *           @arg TIMER4_CNT_EXTCLK:    Uses an external input clock (EXCK) as CNT's count clock
 */
__STATIC_INLINE uint16_t TIMER4_CNT_GetClock(void)
{
    /* Get external clock enable bit */
    return READ_REG16_BIT(M0P_TMR4->CCSR, TMR4_CCSR_ECKEN);
}

/**
 * @brief Set Timer4 CNT mode
 * @param  [in] u16Mode             Timer4 CNT mode
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_MODE_SAWTOOTH_WAVE:    Timer4 count mode:sawtooth wave
 *           @arg TIMER4_CNT_MODE_TRIANGLE_WAVE:    Timer4 count mode:triangular wave
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_SetMode(uint16_t u16Mode)
{
    /* Set external clock enable bit */
    bM0P_TMR4->CCSR_b.MODE = (!!u16Mode);
}

/**
 * @brief Get Timer4 CNT mode
 * @param  None
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_CNT_MODE_SAWTOOTH_WAVE:    Timer4 count mode:sawtooth wave
 *           @arg TIMER4_CNT_MODE_TRIANGLE_WAVE:    Timer4 count mode:triangular wave
 */
__STATIC_INLINE uint16_t TIMER4_CNT_GetMode(void)
{
    /* Get external clock enable bit */
    return READ_REG16_BIT(M0P_TMR4->CCSR, TMR4_CCSR_MODE);
}

/**
 * @brief Start Timer4 CNT
 * @param  None
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_Start(void)
{
    bM0P_TMR4->CCSR_b.STOP = 0ul;
}

/**
 * @brief Stop Timer4 CNT
 * @param  None
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_Stop(void)
{
    bM0P_TMR4->CCSR_b.STOP = 1ul;
}

/**
 * @brief  Get Timer4 CNT interrupt flag
 * @param  [in] u16Flag                 Timer4 flag
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_FLAG_PEAK: Overflow interrupt
 *           @arg TIMER4_CNT_FLAG_ZERO: Underflow interrupt
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
__STATIC_INLINE en_flag_status_t TIMER4_CNT_GetFlag(uint16_t u16Flag)
{
    return READ_REG16_BIT(M0P_TMR4->CCSR, u16Flag) ? Set : Reset;
}

/**
 * @brief  Clear Timer4 CNT interrupt flag
 * @param  [in] u16Flag                 Timer4 flag
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_FLAG_PEAK: Overflow interrupt
 *           @arg TIMER4_CNT_FLAG_ZERO: Underflow interrupt
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_ClearFlag(uint16_t u16Flag)
{
    CLEAR_REG16_BIT(M0P_TMR4->CCSR, u16Flag);
}

/**
 * @brief  Set Timer4 CNT cycle value
 * @param  [in] u16CycleVal             The Timer4 CNT cycle value
 *           @arg number of 16bit
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_SetCycleVal(uint16_t u16CycleVal)
{
    WRITE_REG16(M0P_TMR4->CPSR, u16CycleVal);
}

/**
 * @brief  Get Timer4 CNT cycle value
 * @param  None
 * @retval The cycle value of the Timer4 CNT
 */
__STATIC_INLINE uint16_t TIMER4_CNT_GetCycleVal(void)
{
    return READ_REG16(M0P_TMR4->CPSR);
}

/**
 * @brief  Clear Timer4 CNT count value
 * @param  None
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_ClearCountVal(void)
{
    bM0P_TMR4->CCSR_b.CLEAR = 1ul;
}

/**
 * @brief  Set Timer4 CNT count value
 * @param  [in] u16CountVal             The Timer4 CNT count value
 *           @arg number of 16bit
 * @retval None
 */
__STATIC_INLINE void TIMER4_CNT_SetCountVal(uint16_t u16CountVal)
{
    WRITE_REG16(M0P_TMR4->CNTR, u16CountVal);
}

/**
 * @brief  Get Timer4 CNT count value
 * @param  None
 * @retval The count value of the Timer4 CNT
 */
__STATIC_INLINE uint16_t TIMER4_CNT_GetCountVal(void)
{
    return READ_REG16(M0P_TMR4->CNTR);
}

en_result_t TIMER4_CNT_Init(const stc_timer4_cnt_init_t *pstcInit);
en_result_t TIMER4_CNT_StructInit(stc_timer4_cnt_init_t *pstcInit);
en_result_t TIMER4_CNT_DeInit(void);
void TIMER4_CNT_SetClkDiv(uint16_t u16Div);
uint16_t TIMER4_CNT_GetClkDiv(void);
void TIMER4_CNT_IntCmd(uint16_t u16IntSource, en_functional_state_t enNewSta);
void TIMER4_CNT_SetIntMaskTimes(uint16_t u16IntSource,
                                uint16_t u16MaskTimes);
uint16_t TIMER4_CNT_GetIntMaskTimes(uint16_t u16IntSource);
uint16_t TIMER4_CNT_GetIntMaskCurrentTimes(uint16_t u16IntSource);
en_result_t TIMER4_OCO_Init(uint32_t u32Ch,
                                const stc_timer4_oco_init_t *pstcInit);
en_result_t TIMER4_OCO_StructInit(stc_timer4_oco_init_t *pstcInit);
en_result_t TIMER4_OCO_DeInit(uint32_t u32Ch);
en_result_t TIMER4_OCO_SetOccrBufMode(uint32_t u32Ch,
                                uint16_t u16OccrBufMode);
uint16_t TIMER4_OCO_GetOccrBufMode(uint32_t u32Ch);
en_result_t TIMER4_OCO_OccrLinkTransferCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta);
en_result_t TIMER4_OCO_SetOcmrBufMode(uint32_t u32Ch,
                                uint16_t u16OcmrBufMode);
uint16_t TIMER4_OCO_GetOcmrBufMode(uint32_t u32Ch);
en_result_t TIMER4_OCO_OcmrLinkTransferCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta);
en_result_t TIMER4_OCO_ExtMatchCondCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta);
en_result_t TIMER4_OCO_SetHighChCompareMode(uint32_t u32Ch,
                                const stc_oco_high_ch_compare_mode_t *pstcMode);
en_result_t TIMER4_OCO_SetLowChCompareMode(uint32_t u32Ch,
                                 const stc_oco_low_ch_compare_mode_t *pstcMode);
en_result_t TIMER4_OCO_OutputCompareCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta);
en_result_t TIMER4_OCO_IntCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta);
en_flag_status_t TIMER4_OCO_GetFlag(uint32_t u32Ch);
en_result_t TIMER4_OCO_ClearFlag(uint32_t u32Ch);
en_result_t TIMER4_OCO_SetOcoInvalidOp(uint32_t u32Ch,
                                uint16_t u16OutputPolarity);
uint16_t TIMER4_OCO_GetOutputPolarity(uint32_t u32Ch);
void TIMER4_OCO_SetOccrVal(uint32_t u32Ch, uint16_t u16OccrVal);
uint16_t TIMER4_OCO_GetOccrVal(uint32_t u32Ch);
en_result_t TIMER4_PWM_Init(uint32_t u32Ch,
                                const stc_timer4_pwm_init_t *pstcInit);
en_result_t TIMER4_PWM_StructInit(stc_timer4_pwm_init_t *pstcInit);
en_result_t TIMER4_PWM_DeInit(uint32_t u32Ch);
en_result_t TIMER4_PWM_SetOutputPolarity(uint32_t u32Ch,
                                                uint16_t u16OutputPolarity);
uint16_t TIMER4_PWM_GetOutputPolarity(uint32_t u32Ch);
en_result_t TIMER4_PWM_StartReloadTimer(uint32_t u32Ch);
en_result_t TIMER4_PWM_StopReloadTimer(uint32_t u32Ch);
en_result_t TIMER4_PWM_IntCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta);
en_flag_status_t TIMER4_PWM_GetFlag(uint32_t u32Ch);
en_result_t TIMER4_PWM_ClearFlag(uint32_t u32Ch);
en_result_t TIMER4_PWM_SetDeadRegionValue(uint32_t u32Ch,
                                                uint16_t u16PDAR,
                                                uint16_t u16PDBR);
en_result_t TIMER4_PWM_GetDeadRegionValue(uint32_t u32Ch,
                                                uint16_t *pu16PDAR,
                                                uint16_t *pu16PDBR);
en_result_t TIMER4_PWM_SetFilterCountValue(uint32_t u32Ch,
                                                        uint16_t u16Count);
en_result_t TIMER4_SEVT_Init(uint32_t u32Ch,
                                const stc_timer4_sevt_init_t *pstcInit);
en_result_t TIMER4_SEVT_StructInit(stc_timer4_sevt_init_t *pstcInit);
en_result_t TIMER4_SEVT_DeInit(uint32_t u32Ch);
en_result_t TIMER4_SEVT_SetTriggerEvent(uint32_t u32Ch,
                                                    uint16_t u16Event);
en_result_t TIMER4_SEVT_SetTriggerCondition(uint32_t u32Ch,
                    const stc_timer4_sevt_trigger_cond_t *pstcTriggerCond);
en_result_t TIMER4_SEVT_SetDelayObject(uint32_t u32Ch, uint16_t u16DelayObject);
uint16_t TIMER4_SEVT_GetDelayObject(uint32_t u32Ch);
en_result_t TIMER4_SEVT_SetSccrVal(uint32_t u32Ch,
                                            uint16_t u16SccrVal);
uint16_t TIMER4_SEVT_GetSccrVal(uint32_t u32Ch);
en_result_t TIMER4_SEVT_SetMaskTimes(uint32_t u32Ch,
                                            uint16_t u16MaskTimes);
uint16_t TIMER4_SEVT_GetMaskTimes(uint32_t u32Ch);
void TIMER4_EMB_SetPwmPortPolarity(uint32_t u32PortPolarity);
uint32_t TIMER4_EMB_GetPwmPortPolarity(void);

/**
 * @}
 */

#endif /* DDL_TIMER4_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M120_TIMER4_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
